000010 01 COPY-WORK-AREA1.
000020   03 COPY-WORK-DATA PIC X(10).
000030*
000040 01 COPY-WORK-AREA2.
000050   03 FOO-STR1 PIC X(10).
000060   03 FOO-STR2 PIC X(10).
000070   03 FOO-STR3 PIC X(10).
