000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SAMPLE1.
000030*
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 WORK-AREA1.
000070   03 YYYYMMDD PIC X(8).
000080   03 YYYYMMDD-R REDEFINES YYYYMMDD.
000090     05 YYYY PIC X(4).
000100     05 MM PIC X(2).
000110     05 DD PIC X(2).
000111*
000120 01 WORK-AREA2.
000130   03 HOGE-DATE.
000140     05 YYYY PIC X(4).
000150     05 MM PIC X(2).
000160     05 DD PIC X(2).
000170*
000180 01 EXT-WORK-AREA IS EXTERNAL.
000190   03 EXT-WORK-DATA PIC X(10).
000200*
000201*COPY 句
000210 COPY "COPY1" REPLACING LEADING ==FOO== BY ==BAR==.
000220*
000230 PROCEDURE DIVISION.
000240   PERFORM MOVE-GRP-SEC.
000250   PERFORM REDEFINES-SEC.
000260   PERFORM MOVE-CORR-SEC.
000270   PERFORM CALL-SEC.
000280   PERFORM COPY-SEC.
000290*
000291*多階層のデータ項目へのアクセス
000300   MOVE "01" TO DD OF HOGE-DATE OF WORK-AREA2.
000310   DISPLAY "DD: " DD OF HOGE-DATE OF WORK-AREA2.
000320*
000330   STOP RUN.
000340*
000350*集団項目間の転記
000360 MOVE-GRP-SEC SECTION.
000370   MOVE "20260102" TO YYYYMMDD OF WORK-AREA1.
000380   MOVE WORK-AREA1 TO WORK-AREA2.
000390   DISPLAY "WORK-AREA2: " WORK-AREA2.
000400 MOVE-GRP-SEC-EXIT.
000410   EXIT.
000420*
000430*REDEFINES された項目への MOVE
000440 REDEFINES-SEC SECTION.
000450   MOVE "03" TO MM OF WORK-AREA1.
000460   DISPLAY "YYYYMMDD: " YYYYMMDD.
000470*
000480 REDEFINES-SEC-EXIT.
000490   EXIT.
000500*
000510*MOVE CORRESPONDING
000520 MOVE-CORR-SEC SECTION.
000530   MOVE CORR YYYYMMDD-R TO HOGE-DATE.
000540   DISPLAY "HOGE-DATE: " HOGE-DATE.
000550*
000560 MOVE-CORR-SEC-EXIT.
000570   EXIT.
000580*
000590*CALL
000600 CALL-SEC SECTION.
000610   MOVE "EXTERNAL" TO EXT-WORK-DATA.
000620   DISPLAY "EXT-WORK-DATA: " EXT-WORK-DATA.
000630*
000640   CALL "SUB1" USING HOGE-DATE.
000650   DISPLAY "HOGE-DATE: " HOGE-DATE.
000660   DISPLAY "EXT-WORK-DATA: " EXT-WORK-DATA.
000670*
000680   MOVE "20260102" TO HOGE-DATE.
000690   DISPLAY "HOGE-DATE: " HOGE-DATE.
000700   CALL "SUB1" USING CONTENT HOGE-DATE.
000710   DISPLAY "HOGE-DATE: " HOGE-DATE.
000720*
000730 CALL-SEC-EXIT.
000740   EXIT.
000750*
000760*COPY
000770 COPY-SEC SECTION.
000780   MOVE "COPY-DATA" TO COPY-WORK-DATA.
000790   DISPLAY "COPY-WORK-DATA: " COPY-WORK-DATA.
000800*
000810   MOVE "FOO1" TO BAR-STR1.
000820   MOVE "FOO2" TO BAR-STR2.
000830   MOVE "FOO3" TO BAR-STR3.
000840   DISPLAY "BAR-STR1: " BAR-STR1.
000850   DISPLAY "BAR-STR2: " BAR-STR2.
000860   DISPLAY "BAR-STR3: " BAR-STR3.
000870*
000880 COPY-SEC-EXIT.
000890   EXIT.
