000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. SUB1.
000030*
000040 DATA DIVISION.
000050 WORKING-STORAGE SECTION.
000060 01 EXT-WORK-AREA IS EXTERNAL.
000070   03 EXT-WORK-DATA PIC X(10).
000071*
000072 01 SUB-WORK-AREA.
000073   03 SUB-WORK-DATA PIC X(10).
000080*
000090 LINKAGE SECTION.
000100 01 PARAM-DATE.
000110   03 YYYY PIC X(4).
000120   03 MM PIC X(2).
000130   03 DD PIC X(2).
000140*
000150 PROCEDURE DIVISION USING PARAM-DATE.
000160 DISPLAY "  SUB1: PARAM-DATE: " PARAM-DATE.
000170 MOVE "2027" TO YYYY.
000180*
000190 DISPLAY "  SUB1: EXT-WORK-DATA: " EXT-WORK-DATA.
000200 MOVE "SUB1" TO EXT-WORK-DATA.
000210*
000211 DISPLAY "  SUB1: SUB-WORK-DATA: " SUB-WORK-DATA.
000220 MOVE "SUB-DATA" TO SUB-WORK-DATA.
000221 DISPLAY "  SUB1: SUB-WORK-DATA: " SUB-WORK-DATA.
000222*
000220 EXIT PROGRAM.
